import Test from '../testClass.js';

const tests = [
    new Test(
      `«Саясат» терминін алғаш ғылыми айналымға енгізген ойшыл кім?`, 
      `Аристотель`, 
      [
        `Геродот`,
        `Конфуций`,
        `Демокрит`,
        `Цицерон`
      ],
    ),
    new Test(
      `Саясаттың объектісі?`, 
      `Саясат`, 
      [
        `Экономика`,
        `Мәдениет`,
        `Дін`,
        `Ақпарат`
      ],
    ),
    new Test(
      `Саясаттың басты субъектісі?`, 
      `Адам`, 
      [
        `Топ`,
        `Мемлекет`,
        `Жүйе`,
        `Партия`
      ],
    ),
    new Test(
      `«Саясат дегеніміз мемлекет істеріне қатысу...» -деген пікірдің авторлары:`, 
      `Ежелгі Грекия ойшылдары`, 
      [
        `Орта ғасырлар ойшылдары`,
        `Жаңа заман авторлары`,
        `Марксизм-ленинизм авторлары`,
        `Ежелгі Қытай ойшылдары`
      ],
    ),
    new Test(
      `Үлкен әлеуметтік топтар, сонымен қатар ұлттар және мемлекеттер арасындағы қатынастар шеңберіндегі саяси қызмет?`, 
      `Саясат`, 
      [
        `Экономика`,
        `Мәдениет`,
        `Дін`,
        `Экология`
      ],
    ),
    new Test(
      `Саяси құбылыстарды күрделі құрылымның бір бөлігі ретінде қарап, оны құрайтын элементтердің әлеуметтік өмірдегі орнын, қызметін айналадағы ортамен және құбылыстармен байланысты зерттейтін әдіс түрі?`, 
      `Жүйелеу әдісі`, 
      [
        `Салыстырмалы әдіс`,
        `Әлеуметтік әдіс`,
        `Тарихи әдіс`,
        `Бихевиористік әдіс`
      ],
    ),
    new Test(
      `Саяси құбылыстарды салыстырып, олардың жалпы жақтарын және жеке ерекшеліктерін ажыратуға мүмкіндік беретін әдіс түрі қандай?`, 
      `Салыстырмалы әдіс`, 
      [
        `Жүйелеу әдісі`,
        `Әлеуметтік әдіс`,
        `Тарихи әдіс`,
        `Бихевиористік әдіс`
      ],
    ),
    new Test(
      `Саяси құбылыстарды мерзімі жағынан дәйекті, заманына қарай, бұрынғы, қазіргі және болашақтың байланысын айқындай отырып қарастыратын әдіс түрі?`, 
      `Тарихи әдіс`, 
      [
        `Салыстырмалы әдіс`,
        `Жүйелеу әдісі`,
        `Нормативтік әдіс`,
        `Бихевиористік әдіс`
      ],
    ),
    new Test(
      `Жеке адамдар мен топтардың іс-әрекетін, белгілі бір саяси жағдайларда адамдардың өздерін қалай ұстауын талдауға негізделген әдіс түрі?`, 
      `Бихевиористік әдіс?`, 
      [
        `Жүйелеу әдісі`,
        `Әлеуметтік әдіс`,
        `Нормативтік әдіс`,
        `Салыстырмалы әдіс`
      ],
    ),
    new Test(
      `Саясатты қоғам өмірінің экономикалық, әлеуметтік құрылым, мәдениет жағдайына байланысты анықтау әдісі?`, 
      `Социологиялық әдіс`, 
      [
        `Салыстырмалы әдіс`,
        `Жүйелеу әдісі`,
        `Тарихи әдіс`,
        `Нормативтік әдіс`
      ],
    ),
    new Test(
      `Саясаттану ғылымының Кеңес Одағы кезіндегі ең дұрыс және мызғымас тәсілі болып есептелген әдіс түрі?`, 
      `Диалектикалық-материалистік әдіс`, 
      [
        `Бихевиористік әдіс`,
        `Нормативтік әдіс`,
        `Тарихи әдіс`,
        `Салыстырмалы әдіс`
      ],
    ),
    new Test(
      `Саясаттың қоғамдағы оқиғаларды танып білуге, олардың саяси мәнін түсінуге мүмкіндік беретін қызметінің түрі?`, 
      `Танымдық қызметі`, 
      [
        `Аксеологиялық қызметі`,
        `Реттеушілік қызметі`,
        `Жетілдіру қызметі`,
        `Басқару қызметі`
      ],
    ),
    new Test(
      `Саяси құрылысқа, институттарға, іс-әрекеттерге және саяси оқиғаларға саяси баға беретін қызметтің түрі?`, 
      `Аксеологиялық қызметі`, 
      [
        `Гносеологиялық қызметі`,
        `Реттеушілік қызметі`,
        `Басқару қызметі`,
        `Жетілдіру қызметі`
      ],
    ),
    new Test(
      `Қоғамда үстемдік ететін мәдени бағыттан айтарлықтай ерекшеленетін саяси бағдар?`, 
      `Субмәдениет`, 
      [
        `Демократия мәдениеті`,
        `Патриархтық мәдениет`,
        `Қоғамшыл тұрпаттағы саяси мәдениет`,
        `Азаматтық тұрпаттағы саяси мәдениет`
      ],
    ),
    new Test(
      `«Екінші ұстаз» деп қай ойшылды айтады?`, 
      `Әл-Фараби`, 
      [
        `Низами`,
        `Навои`,
        `Әл-Кинди`,
        `Абай`
      ],
    ),
    new Test(
      `Тауке хан тұсындағы қазақ әдет-ғұрып заңдарының жинағы қалай аталады?`, 
      `«Жеті жарғы»`, 
      [
        `«Билер кеңесі»`,
        `«Нақыл сөздер» жинағы`,
        `«Халық кеңесі»`,
        `«Яссы»`
      ],
    ),
    new Test(
      `Консерватизмнің негізгі белгісі қандай?`, 
      `Ескі тәртіпті өзгеріссіз сақтау`, 
      [
        `Ой еркіндігі`,
        `Қоғамның төңкеріс жолымен өзгеруі`,
        `Қоғам өміріне жаңа тәртіп енгізу`,
        `Сөз еркіндігі`
      ],
    ),
    new Test(
      `Қай идеологиялық ағым мемлекеттік билікті жоюға бағытталған?`, 
      `Анархизм`, 
      [
        `Социализм`,
        `Либерализм`,
        `Консерватизм`,
        `Коммунизм`
      ],
    ),
    new Test(
      `Саясаттың негізгі мәселесі?`, 
      `Саяси билік`, 
      [
        `Саяси мәдениет`,
        `Саяси партия`,
        `Саяси сана`,
        `Саяси идеология`
      ],
    ),
    new Test(
      `Биліктің басты түрі?`, 
      `Саяси билік`, 
      [
        `Сот билігі`,
        `Үкімет билігі`,
        `Парламент билігі`,
        `Әскери билік`
      ],
    ),
    new Test(
      `Қазақтың алғашқы «Алаш» саяси партиясы қай жылы құрылды?`, 
      `1917 ж.`, 
      [
        `1937 ж.`,
        `1925 ж.`,
        `1905 ж.`,
        `1991 ж.`
      ],
    ),
    new Test(
      `Саяси тәртіптің қай түрінде мемлекеттік билікті үш тармаққа бөлу принципі сақталады?`, 
      `Демократия`, 
      [
        `Монархия`,
        `Диктатура`,
        `Тоталитаризм`,
        `Авторитаризм`
      ],
    ),
    new Test(
      `Конституция бойынша парламенттік басқару жүйесіне негізделген мемлекеттік құрылымның түрі?`, 
      `Парламенттік республика`, 
      [
        `Құқықтық.мемлекет`,
        `Демократиялық мемлекет`,
        `Зайырлы мемлекет`,
        `Президенттік мемлекет`
      ],
    ),
    new Test(
      `Бірнеше мемлекеттік құрылымдардың бірігіп, бір одақтық мемлекет құруы?`, 
      `Федерация`, 
      [
        `Унитаризм`,
        `Конфедерация`,
        `Монархия`,
        `Автократия`
      ],
    ),
    new Test(
      `Жеке басының қабілеттілігіне байланысты топ ішінде жіктелетін жетекші түрі?`, 
      `Харизматикалық`, 
      [
        `Дәстүрлі`,
        `Жаңашыл рационалды`,
        `Құқықтық ережелерге байланысты`,
        `Дәстүрлі емес`
      ],
    ),
    new Test(
      `Уақыт талабына сай қысылтаяң жағдайларда шапшаң шешім таба алатын жетекші?`, 
      `Өрт сөндіруші жетекші`, 
      [
        `Саудагер жетекші`,
        `Қызмет етуші жетекші`,
        `Ту көтерер саяси жетекші`,
        `Харизматикалық жетекші`
      ],
    ),
    new Test(
      `Алға қойылған мақсатқа жету үшін мемлекеттік билікке ұмтылатын белгілі бір топтың ең белсенді және ұйымдасқан бөлігі?`, 
      `Саяси партия`, 
      [
        `Қоғамдық бірлестік`,
        `Кәсіподақ ұйымы`,
        `Астыртын топ`,
        `Әскери бөлім`
      ],
    ),
    new Test(
      `Тоталитарлық режим белгісі?`, 
      `Қатаң мемлекеттік бақылауға алынған басқару жүйесі`, 
      [
        `Көп партиялық жүйе`,
        `Әділетті сайлау жүйесі`,
        `Қабілетті адамдардың билігіне негізделген басқару жүйесі`,
        `Бір адамның шексіз билігіне негізделген басқару жүйесі`
      ],
    ),
    new Test(
      `Жеке адамның саяси-заңдық құқығын қорғауды жан-жақты қамтамасыз ететін мемлекеттің түрі?`, 
      `Құқықтық мемлекет`, 
      [
        `Әлеуметтік мемлекет`,
        `Полициялық мемлекет`,
        `Феодалдық мемлекет`,
        `Азаматтық қоғам`
      ],
    ),
    new Test(
      `Қоғамдағы саяси институттардың, саяси қатынастардың, саяси ережелердің және саяси мәдениеттің жиынтығы?`, 
      `Саяси жүйе`, 
      [
        `Саяси режим`,
        `Ассамблея`,
        `Саяси одақ`,
        `Саяси билік`
      ],
    ),
    new Test(
      `Қай ойшылдың ілімі бойынша Қайырымды қала басшысы туа біткен 12 қасиетке ие болуы тиіс?`, 
      `Әл-Фараби`, 
      [
        `Августин Аврелий`,
        `Ибн Сина`,
        `Платон`,
        `Конфуций`
      ],
    ),
    new Test(
      `Қоғамның барлық әлеуметтік-экономикалық саяси құрылымындағы түбегейлі сапалы төңкеріс?`, 
      `Революция`, 
      [
        `Эволюция`,
        `Реформация`,
        `Реакция`,
        `Референдум`
      ],
    ),
    new Test(
      `Қазақстан Парламентінің Жоғарғы палатасы қалай аталады?`, 
      `Сенат`, 
      [
        `Конгресс`,
        `Мәслихат`,
        `Дума`,
        `Сейм`
      ],
    ),
    new Test(
      `Демократия дегеніміз не?`, 
      `Халықтың билігі`, 
      [
        `Бір адамның билігі`,
        `Бір топтың билігі`,
        `Тобыр билігі`,
        `Жоғарғы тап билігі`
      ],
    ),
    new Test(
      `Қазақстан Республикасының Президенті болып қанша жасқа толған азамат сайлана алады?`, 
      `40 жас`, 
      [
        `50 жас`,
        `35 жас`,
        `30 жас`,
        `45 жас`
      ],
    ),
    new Test(
      `Бір адамға шексіз жоғарғы өкімет билігін беру арқылы басқару жүйесі:`, 
      `Автократия`, 
      [
        `Группократия`,
        `Бюрократия`,
        `Телократия`,
        `Демократия`
      ],
    ),
    new Test(
      `Мемлекеттік өмірдің аса маңызды мәселесі бойынша бүкілхалықтық дауыс беру:`, 
      `Референдум`, 
      [
        `Форум`,
        `Плебисцит`,
        `Съезд`,
        `Жиналыс`
      ],
    ),
    new Test(
      `Саяси мүдде, мақсат, ерік, сезім, көңіл-күй, пікір, нанымды қамтитын саяси сананың саласы?`, 
      `Саяси психология`, 
      [
        `Саяси идеология`,
        `Саяси әлеуметтену`,
        `Саяси билік`,
        `Саяси ғылым`
      ],
    ),
    new Test(
      `Белгілі бір әлеуметтік топтар, таптар, партиялардың мақсаттары мен мүдделерін бейнелейтін тұжырымдамалардың, идеялар мен көзқарастардың жүйесі:`, 
      `Идеология`, 
      [
        `Мәдениет`,
        `Мораль`,
        `Дін`,
        `Саясат`
      ],
    ),
    new Test(
      `Фашистік режим көбінде қай саяси жүйеге сәйкес келеді:`, 
      `Тоталитарлық`, 
      [
        `Демократиялық`,
        `Ашық`,
        `Авторитарлық`,
        `Плутократиялық`
      ],
    ),
    new Test(
      `Қазақстандағы партиялық жүйесі?`, 
      `Көп партиялық`, 
      [
        `Бір партиялық`,
        `Екі партиялық`,
        `Саяси жүйе жоқ`,
        `Бипартизм`
      ],
    ),
    new Test(
      `Әлеуметтік дау-жанжалдарды зерттейтін пәнаралық ілім?`, 
      `Конфликтология`, 
      [
        `Социология`,
        `Этика`,
        `Мәдениеттану`,
        `Дефектология`
      ],
    ),
    new Test(
      `Мемлекет қай қоғамдық құрылыста пайда болды?`, 
      `Құлдық`, 
      [
        `Алғашқы қауымдық`,
        `Феодалдық`,
        `Капиталистік`,
        `Социалистік`
      ],
    ),
    new Test(
      `Біртұтас мемлекеттің белгісі?`, 
      `Саяси билік бір орталыққа бағынған`, 
      [
        `Әртүрлі құқық жүйесі қалыптасқан`,
        `Бөлек сот органдары бар`,
        `Қазақстан Республикасының азаматтығы`,
        `Екі азаматтықтың болуы`
      ],
    ),
    new Test(
      `Заң шығару қызметін жүзеге асыратын орган?`, 
      `Парламент`, 
      [
        `Президент`,
        `Үкімет`,
        `Мәслихат`,
        `Кеңес`
      ],
    ),
    new Test(
      `Президенттің өкілеттілік мерзімі:`, 
      `7 жыл`, 
      [
        `5 жыл`,
        `6 жыл`,
        `10 жыл`,
        `3 жыл`
      ],
    ),
    new Test(
      `Мәжіліс депутаттарының өкілеттік мерзімі:`, 
      `5 жыл`, 
      [
        `7 жыл`,
        `6 жыл`,
        `10 жыл`,
        `3 жыл`
      ],
    ),
    new Test(
      `Сенат депутаттарының өкілеттік мерзімі:`, 
      `6 жыл`, 
      [
        `7 жыл`,
        `5 жыл`,
        `10 жыл`,
        `3 жыл`
      ],
    ),
    new Test(
      `Қоғамның негізгі саяси институты?`, 
      `Мемлекет`, 
      [
        `Құқық қорғау органдары`,
        `Саяси құрылымдар`,
        `Саяси партиялар`,
        `Қоғамдық ұйымдар`
      ],
    ),
    new Test(
      `Монархияда биліктің көзі:`, 
      `Монарх`, 
      [
        `Халық`,
        `Партия`,
        `Мемлекет`,
        `Шаруа`
      ],
    ),
    new Test(
      `«Культура» термині қай тілден алынған:`, 
      `Латын`, 
      [
        `Грек`,
        `Орыс`,
        `Неміс`,
        `Француз`
      ],
    ),
    new Test(
      `Типология ұғымы қай тілден енген:`, 
      `Грек`, 
      [
        `Латын`,
        `Француз`,
        `Орыс`,
        `Неміс`
      ],
    ),
    new Test(
      `Мәдениет қалыптастырған құндылықтар жүйесі тарихи қандай реттілікпен дамыды:`, 
      `Мифология, дін, философия, ғылым`, 
      [
        `Дін, мифология, философия, ғылым`,
        `Философия, дін, мифология, ғылым`,
        `Ғылым, философия, дін, мифология`,
        `Дін, ғылым, философия, мифология`
      ],
    ),
    new Test(
      `Мәдениеттану қандай ғылымдардың құрамына жатады?`, 
      `Гуманитарлық ғылымдар`, 
      [
        `Саяси ғылымдар`,
        `Жаратылыстау ғылымдары`,
        `Тарихи ғылымдар`,
        `Әлеуметтік ғылымдар`
      ],
    ),
    new Test(
      `«Цивилизация» ұғымының бастапқы этимологиялық мағынасы:`, 
      `Азаматтық қоғам`, 
      [
        `Ақыл-ой негізінде құрылған қоғам`,
        `Мемлекеттік мүде`,
        `Қалалық`,
        `Мәдениеттік`
      ],
    ),
    new Test(
      `Мәдениеттану жеке ғылым ретінде қай ғылымнан бөлінді?`, 
      `Философия`, 
      [
        `Тарих`,
        `Этнография`,
        `Әлеуметтану`,
        `Саясаттану`
      ],
    ),
    new Test(
      `Еуропадағы ортағасырлық мәдениетте дүниетанымның қай түрі үстем болды?`, 
      `Дін`, 
      [
        `Өнер`,
        `Философия`,
        `Құқық`,
        `Ғылым`
      ],
    ),
    new Test(
      `Мәдениеттің құрамдас бөліктері:`, 
      `Материалдық және рухани`, 
      [
        `Тәрбиелік және білім`,
        `Дін, өнер, құқық`,
        `Ұжымдық және жеке`,
        `Этикалық және эстетикалық`
      ],
    ),
    new Test(
      `Қандай мәдениет ұғымы мінез өлшеміне байланысты айтылған, ол:`, 
      `Этика`, 
      [
        `Эстетика`,
        `Өнер`,
        `Білім`,
        `Ғылым`
      ],
    ),
    new Test(
      `Рухани мәдениетке жатады:`, 
      `Дін`, 
      [
        `Тұрғын үй`,
        `Киім -кешек`,
        `Ғимараттар`,
        `Тұрмыстық зат`
      ],
    ),
    new Test(
      `Қандай тілдер жасанды тілге жатады:`, 
      `Бағдарлама және машина тілі`, 
      [
        `Ұлтаралық қарым-қатынас тілдері`,
        `Ғылым және техника тілі`,
        `Ұлттық тілдер`,
        `Мемлекеттік тіл`
      ],
    ),
    new Test(
      `Мәдениетті сақтау тәсілі, ол:`, 
      `Дәстүр`, 
      [
        `Ақпарат`,
        `Жаңалық ашу`,
        `Адамгершілік`,
        `Компьютерлендіру`
      ],
    ),
    new Test(
      `Материалдық мәдениетке жатады:`, 
      `Тұрмыстық заттар, киім -кешек`, 
      [
        `Адамгершілік, ізгілік`,
        `Философия, эстетика`,
        `Әдебиет, мифология`,
        `Әңгіме, ертегі`
      ],
    ),
    new Test(
      `Аксиология нені білдіретін ұғым?`, 
      `Құндылықтар теориясын`, 
      [
        `Мораль теориясын`,
        `Өмір философисын`,
        `Тарихи-мәдени типтер теориясын`,
        `Этногенез теориясын`
      ],
    ),
    new Test(
      `Рәміз дегеніміз:`, 
      `Шартты белгі`, 
      [
        `Ашылмаған белгі`,
        `Жалпыланған белгі`,
        `Қол өнері`,
        `Жазу`
      ],
    ),
    new Test(
      `Менталитет ұғымы мәдениеттің қай деңгейімен тығыз байланысты?`, 
      `Ұлттық мәдениет`, 
      [
        `Суперөркениет`,
        `Субмәдениет`,
        `Әлемдік мәдениет`,
        `Рухани мәдениет`
      ],
    ),
    new Test(
      `Баға жетпес ұлттық байлық, ол:`, 
      `Тіл`, 
      [
        `Білім`,
        `Достық қатынас`,
        `тәрбие жұмыс`,
        `Ғылым`
      ],
    ),
    new Test(
      `Мифология дегеніміз не?`, 
      `Дүниетанымның тарихи типі`, 
      [
        `Ғылым, мәдени интеграция, эволюция`,
        `Дін`,
        `Философия`,
        `Өнердің түрі`
      ],
    ),
    new Test(
      `Алғашқы тарихи-мәдени үлгілердің біреуін атаңыз?`, 
      `Миф`, 
      [
        `Әңгіме`,
        `Ертегі`,
        `Жазбалар`,
        `Мақал-мәтелдер`
      ],
    ),
    new Test(
      `Архаикалық мәдениет деп нені айтады?`, 
      `Алғашқы қауымдағы мәдениет`, 
      [
        `Қайта өрлеу дәуірі мәдениеті`,
        `Ортағасырлар мәдениеті`,
        `Келешек мәдениеті`,
        `Ағартушылық мәдениет`
      ],
    ),
    new Test(
      `Рухани мәдениетке қайсысы жатпайды?`, 
      `Технология`, 
      [
        `Өнер`,
        `Дін`,
        `Философия`,
        `Адамгершілік`
      ],
    ),
    new Test(
      `Салт-дәстүр дегеніміз:`, 
      `Ұрпақтан ұрпаққа берілетін құнды тәжірибелер, рәсімдер`, 
      [
        `Қажеттілік, тілеушілік`,
        `Мақсат, ақиқат, бағыттар`,
        `Идеялар, идеалдар, идеология`,
        `Болжау, анықтау`
      ],
    ),
    new Test(
      `Аристотельден кейінгі «екінші ұстаз» атанған араб-ислам философияның өкілі болған кім?`, 
      `Әл-Фараби`, 
      [
        `А.Бируни`,
        `Ибн-Сина`,
        `А.Яссауи`,
        `Қашкари`
      ],
    ),
    new Test(
      `«Құтты білік» кімнің шығармасы?`, 
      `Ж.Баласағұн`, 
      [
        `М.Қашқари`,
        `Әл-Фараби`,
        `А.Яссауи`,
        `Ш.Құдайбердиев`
      ],
    ),
    new Test(
      `Қазақ аңыздарының желісі бойынша «Мәңгілік өмірді» іздеген кім:`, 
      `Қорқыт`, 
      [
        `Асанқайғы`,
        `Алпамыс`,
        `Қобыланды`,
        `Ер Сайын`
      ],
    ),
    new Test(
      `Көрсетілген қай батырлық эпос қазақ халқының рухани мұрасына жатпайды:`, 
      `Манас`, 
      [
        `Алпамыс`,
        `Ер Төстік`,
        `Ер Тарғын`,
        `Қобыланды`
      ],
    ),
    new Test(
      `«Диуани лұғат ат-түрік» - «Түрік сөздерінің грамматикасы» кімнің шығармасы?`, 
      `М.Қашқари`, 
      [
        `Ш.Құдайбердиев`,
        `Әл-Фараби`,
        `С.Бақырғани`,
        `А.Яссауи`
      ],
    ),
    new Test(
      `«Диуани Хикмет» - «Ақыл кітабы» кімнің шығармасы?`, 
      `А.Яссауи`, 
      [
        `М.Дулати`,
        `С.Бақырғани`,
        `А.Иүгініки`,
        `М.Қашқари`
      ],
    ),
    new Test(
      `Қазақстанның көне тайпалар мәдениеті:`, 
      `Сақтар, Үйсіндер, Ғұндар`, 
      [
        `Қаңлы, Найман, Қидандар`,
        `Өзбектер, Жалайырлар, Түркімендер`,
        `Қыпшақтар, Ногайлар, Хазарлар`,
        `Қалмақтар, Монғолдар, Жоңғарлар`
      ],
    ),
    new Test(
      `Жырау шығармашылығының әйгілі өкілі.`, 
      `Бұқар`, 
      [
        `Асан Қайғы`,
        `Ақан сері`,
        `Айтыс`,
        `Мақам`
      ],
    ),
    new Test(
      `Ақындар сайысы осылай аталады:`, 
      `Айтыс`, 
      [
        `Күй`,
        `Ән`,
        `Сарын`,
        `Мақам`
      ],
    ),
    new Test(
      `«Жар-жар» - деген:`, 
      `Үйлену тойының өлеңі`, 
      [
        `Сауығу өлеңі`,
        `Жоқтау`,
        `Өмір мәні туралы монолог-өлең`,
        `Достар туралы өлең`
      ],
    ),
    new Test(
      `Төле би, Әйтеке би, Қазыбек би:`, 
      `Би-шешендер`, 
      [
        `Айтыс ақыны`,
        `Ақындар`,
        `Әскер басшылары`,
        `Музыканттар`
      ],
    ),
    new Test(
      `«Киіз үй» - ол:`, 
      `Көшпенділердің микрокосмосы`, 
      [
        `Аспан әлемінің шағылысуы`,
        `Табиғи күштерден қорғау`,
        `Өмір мәні туралы монолог-өлең`,
        `Айтыс, көркем сөз`
      ],
    ),
    new Test(
      `«Қазақ хрестоматиясының» авторы:`, 
      `Ы.Алтынсарин`, 
      [
        `О.Сүлейменов`,
        `М.Аджи`,
        `С.Сейфуллин`,
        `М.Әуезов`
      ],
    ),
    new Test(
      `«Жоңғария очерктері» авторы кім?`, 
      `Ш. Уәлиханов`, 
      [
        `А. Құнанбаев`,
        `А.Байтұрсынов`,
        `С.Торайғыров`,
        `М. Жұмабаев`
      ],
    ),
    new Test(
      `А.Құнанбаев, Ы.Алтынсарин, Ш.Уәлихановтар кімдер?`, 
      `Ұлы ағартушы - ойшылдар`, 
      [
        `Атақты бай саудагерлер`,
        `Суретшілер`,
        `Ақындар`,
        `Ру мен жүздердің басшысы`
      ],
    ),
    new Test(
      `«Ленинградтық өрендерім!» атты өлеңнің авторы:`, 
      `Ж. Жабаев`, 
      [
        `Ә. Қашаубаев`,
        `В. Затаевич`,
        `К. Әзірбаев`,
        `Е. Брусиловский`
      ],
    ),
    new Test(
      `Қазақтың ұлы күйшісі:`, 
      `Құрманғазы`, 
      [
        `Н.Тілендиев`,
        `Бұқар жырау`,
        `Асан қайғы`,
        `М.Өтемісов`
      ],
    ),
    new Test(
      `Қазақ өнерінің суырып салма түрі, ол:`, 
      `Айтыс`, 
      [
        `Күй`,
        `Толғау`,
        `Жоқтау`,
        `Миф`
      ],
    ),
    new Test(
      `Сақтардың қолданбалы өнері қай стильді көрсетеді?`, 
      `Аңдық`, 
      [
        `Академиалық`,
        `Готикалық.`,
        `Классикалық`,
        `Арабша`
      ],
    ),
    new Test(
      `ХІІІ ғ. ғашықтар үлгісі аталатын сәулет ескерткіші:`, 
      `Айша-Бибі`, 
      [
        `Ахмет Яссауи`,
        `Бабаджа Хатун`,
        `Қарахан`,
        `Домалақ ана`
      ],
    ),
    new Test(
      `ХІХ ғ.Қазақстандағы бастауыш мектептердің ашылуы кімнің есімімен байланысты?`, 
      `Ы.Алтынсарин`, 
      [
        `Ш.Құдайбердиев`,
        `А.Байтұрсынов`,
        `А.Құнанбаев`,
        `М.Әуезов`
      ],
    ),
    new Test(
      `Ертедегі қазақтардың негізгі діни сенімі, құлшылығы:`, 
      `Көк тәңірі`, 
      [
        `Жерге табыну`,
        `Суға табыну`,
        `Өсімдіктерге табыну`,
        `Шаруашылық мәдениет`
      ],
    ),
    new Test(
      `Қазақ Ұлттық Ғылым академиясының бірінші академигі:`, 
      `Қ. Сәтбаев`, 
      [
        `Ә. Марғұлан`,
        `А. Жұбанов`,
        `С. Мұқанов`,
        `Қ. Жұмалиев`
      ],
    ),
    new Test(
      `М.Әуэзовтің атақты шығармасы?`, 
      `Абай жолы`, 
      [
        `Аққан жұлдыз`,
        `Үш анық`,
        `Қамар сұлу`,
        `Көшпенділер`
      ],
    ),
    new Test(
      `М.Х.Дулатидың мұрасы:`, 
      `«Тарих-и Рашиди»`, 
      [
        `«Диуани хикмет»`,
        `«Құтты білік»`,
        `«Диуани лұғат ат түрік»`,
        `«Қорқыт ата»`
      ],
    ),
    new Test(
      `ХIХ ғасырдағы қазақ ағартушысы:`, 
      `Ы.Алтынсарин`, 
      [
        `А. Байтұрсынов`,
        `Әбілхайыр`,
        `Ж.Жабаев`,
        `С.Сейфуллин`
      ],
    ),
    new Test(
      `Отырар қаласының көне атауы:`, 
      `Фараб`, 
      [
        `Шам`,
        `Шаш`,
        `Тараз`,
        `Исфиджаб`
      ],
    ),
    new Test(
      `ХIХ ғасырда өмір сүрген қазақ ағартушысы:`, 
      `Ш.Уәлиханов`, 
      [
        `А.Байтұрсынов`,
        `Әбілхайыр`,
        `Ж.Жабаев`,
        `С.Сейфуллин`
      ],
    ),
    new Test(
      `Саясатты теологиялық ойлаудан арылтып, саяси ойды қоғамдағы табиғи өмірден туған мәселелерді шешуге бейімдеген кім?`, 
      `Н.Макиавелли`, 
      [
        `Т.Джефферсон`,
        `Ф.Аквинский`,
        `Т.Пейн`,
        `М.Вебер`
      ],
    ),
    new Test(
      `"Саясат", "Афиналық политея" еңбектерінің авторы кім?`, 
      `Аристотель`, 
      [
        `Цицерон`,
        `Платон`,
        `Демокрит`,
        `Сократ`
      ],
    ),
    new Test(
      `Саясатты, билікті құдайдың құдіретімен түсіндіретін парадигма?`, 
      `Теологиялық парадигма`, 
      [
        `Натуралистік парадигма`,
        `Сыни парадигма`,
        `Әлеуметтік парадигма`,
        `Жанжалдық парадигма`
      ],
    ),
    new Test(
      `Саясатты табиғи себептермен, географиялық ортамен, биологиялық және психологиялық ерекшеліктермен түсіндіретін парадигма?`, 
      `Натуралистік парадигма`, 
      [
        `Әлеуметтік парадигам`,
        `Сыни парадигма`,
        `Теологиялық парадигма`,
        `Жанжалдық парадигма`
      ],
    ),
    new Test(
      `Парадигма ұғымын ХХ ғасырдың 20-жылдарында ғылыми әдебиетке алғаш енгізген американ философы?`, 
      `Г.Кун`, 
      [
        `Т.Парсонс`,
        `Д.Истон`,
        `Г.Алмонд`,
        `Геродот`
      ],
    ),
    new Test(
      `Көне римдік шешен, ойшыл, саяси қайраткер, "Мемлекет туралы", "Заңдар туралы", "Міндеттер туралы" еңбектерінің авторы, құқықтық мемлекет идеясының негізін салушы?`, 
      `Цицерон`, 
      [
        `Аристотель`,
        `Платон`,
        `Гераклит`,
        `Сократ`
      ],
    ),
    new Test(
      `Қазақ халқынан шыққан ұлы ұстаз, ағартушы Ш.Уалихановтың саяси көзқарастарын білдіретін еңбегі?`, 
      `«Сот реформасы жайындағы хат»`, 
      [
        `«Рақымды қала тұрғындарының көзқарастары»`,
        `«Қазақ даласындағы жұт жөнінде»`,
        `«Оян, қазақ!»`,
        `«Бақыттылық жайлы ілім»`
      ],
    ),
    new Test(
      `Кемшіліксіз қоғам үш таптан (билеушілер-философтар, қорғаушылар- әскер, өндірушілер) тұрады деп есептеген ойшыл?`, 
      `Платон`, 
      [
        `Аристотель`,
        `Цицерон`,
        `Демокрит`,
        `Сократ`
      ],
    ),
    new Test(
      `ХХ ғасырдың басында Батыс елдерінде солидаризм ілімінің негізін салушы ғалым?`, 
      `Л.Дюги`, 
      [
        `М.Вебер`,
        `В.Парето`,
        `Ф.Ратцель`,
        `Г.Моска`
      ],
    ),
    new Test(
      `Католик шіркеуінің патшалық құруын алдарына мақсат еткен XYІ ғасырдағы батыс және орталық Европаның бірқатар мемлекетін кең қамтыған қоғамдық-саяси қозғалыс?`, 
      `Реформация`, 
      [
        `Обструкция`,
        `Ассимиляция`,
        `Референдум`,
        `Процесс`
      ],
    ),
    new Test(
      `Христиан дінінің теориясын жасап, шыңына жеткізген ортағасырлық құдайшыл ойшыл?`, 
      `Ф.Аквинский`, 
      [
        `Т.Мор`,
        `М.Падуанский`,
        `Ж.Боден`,
        `Т.Гоббс`
      ],
    ),
    new Test(
      `Саяси идеялардың дамуында радикализмнің негізін салушы және«Қоғамдық келісім» еңбегінің авторы кім?`, 
      `Т.Гоббс`, 
      [
        `Ш.Монтескье`,
        `И.Кант`,
        `Дж.Локк`,
        `Ж.Ж.Руссо`
      ],
    ),
    new Test(
      `ХІХ ғасырдағы Қытайдың отаршылдық басқару жүйесіне талдау жасаған қазақ ойшылы?`, 
      `Ш.Уәлиханов`, 
      [
        `А.Құнанбаев`,
        `Ш.Құдайбердиев`,
        `Ы.Алтынсарин`,
        `Ә.Бөкейханов`
      ],
    ),
    new Test(
      `Саясаттың парадигмасы - бұл?`, 
      `саяси ақиқатты ұғыну мен түсіндірудің ерекше логикалық ойлау үлгісі`, 
      [
        `жасалынған іс-әрекеттерді негіздеу`,
        `өмір сүріп тұрған жүйені елеулі өзгерістерсіз қайта құру құбылысы`,
        `саяси ақиқат әдісі`,
        `жалпыға міндетті ережелер жүйесі`
      ],
    ),
    new Test(
      `Қазақ халқынан шыққан ұлы ұстаз, ағартушы Ы.Алтынсариннің саяси көзқарастарын білдіретін еңбегі?`, 
      `«Қазақ даласындағы жұт жөнінде»`, 
      [
        `«Сот реформасы жайындағы хат»`,
        `«Бақыттылық жайлы ілім»`,
        `«Рақымды қала тұрғындарының көзқарастары»`,
        `«Оян, қазақ!»`
      ],
    ),
    new Test(
      `Мемлекеттік немесе билеуші аппараттың қызметіне қатысы жоқ саяси белсенді адамдардың, кәсіби емес саяси қызметтерінің әр түрлі формалары арқылы олардың жұмысына ықпал етуге тырысуы?`, 
      `саяси қатысу`, 
      [
        `саяси болжау`,
        `саяси қызмет`,
        `саяси шешім`,
        `саяси прогресс`
      ],
    ),
    new Test(
      `Билікті басқа адамдардың жүріс-тұрысын, өзін-өзі ұстауын өзгерту мүмкіншілігі деп түсіндіретін анықтама?`, 
      `Бихевиористік анықтама`, 
      [
        `Инструменталистік анықтама`,
        `Структуралистік анықтама`,
        `Конформистік анықтама`,
        `Телеологиялық анықтама`
      ],
    ),
    new Test(
      `Билікті даулы жағдайларда игілікті бөлісуді реттеу құралы ретінде түсіндіру биліктің қай анықтамасына жатады?`, 
      `Конфликтілік`, 
      [
        `Теологиялық`,
        `Структуралистік`,
        `Бихевиористік`,
        `Инструменталистік`
      ],
    ),
    new Test(
      `Тәуелсіз мемлекеттердің одағы?`, 
      `Конфедерация`, 
      [
        `Федерация`,
        `Унитарлық мемлекет`,
        `Монархиялық мемлекет`,
        `Республика`
      ],
    ),
    new Test(
      `Тобыр билігі?`, 
      `Охлократия`, 
      [
        `Аристократия`,
        `Олигархия`,
        `Демократия`,
        `Плутократия`
      ],
    ),
    new Test(
      `Қай жылы Қазақстан Республикасында президенттік басқару енгізілді?`, 
      `1990 ж.`, 
      [
        `1991 ж.`,
        `1989 ж.`,
        `1994 ж.`,
        `1992 ж.`
      ],
    ),
    new Test(
      `Алғаш рет мемлекет типтерін кім ұсынды?`, 
      `Аристотель`, 
      [
        `Геродот`,
        `Перикл`,
        `Пифагор`,
        `Әл-Фараби`
      ],
    ),
    new Test(
      `«Мақсат әдіс-тәсілді ақтайды» деген қағиданың авторы кім?`, 
      `Макиавелли`, 
      [
        `Гоббс`,
        `Руссо`,
        `Монтескье`,
        `Демокрит`
      ],
    ),
    new Test(
      `Жеке адамның билігіне негізделген, басқаруда күшке сүйенетін мемлекеттік-саяси тәртіп?`, 
      `Авторитаризм`, 
      [
        `Тоталитаризм`,
        `Демократия`,
        `Фашизм`,
        `Тирания`
      ],
    ),
    new Test(
      `Саяси биліктің шіркеу, дін иелерінің басқаруына негізделген түрі:`, 
      `Теократия`, 
      [
        `Меритократия`,
        `Демократия`,
        `Аристократия`,
        `Плутократия`
      ],
    ),
    new Test(
      `Саяси жанжалдарды шешуді қарсы жақтар дау, талас тудырған мәселені тексеруге өз еріктерімен үшінші жаққа беру арқылы мәселені шешу әдісі қалай аталады?`, 
      `Аралық сот немесе арбитраждық сараптау әдісі`, 
      [
        `Мәмілеге келу арқылы бейбіт жолмен шешу`,
        `Кейінге қалдыру әдісі`,
        `Зорлық негізінде бітістіру, келістіру әдісі`,
        `Дау жанжалдарға бармау, қашқақтау әдісі`
      ],
    ),
    new Test(
      `Ежелгі Грекияда идеалды мемлекет идеясын кім ұсынды?`, 
      `Платон`, 
      [
        `Томас Гоббс`,
        `Аристотель`,
        `Лукреций Кар`,
        `Джон Локк`
      ],
    ),
    new Test(
      `Билікті белгілі бір мақсатқа, нәтижеге, қорытындығы жету мүмкіндігі деп түсіндіретін анықтама?`, 
      `Телеологиялық анықтама`, 
      [
        `Бихевиористік анықтама`,
        `Инструменталистік анықтама`,
        `Стуктуралистік анықтама`,
        `Конфликтілік анықтама`
      ],
    ),
    new Test(
      `Билікті басқарушы мен бағынушының арасындағы қатынастың ерекше түрі деп тұжырымдайтын анықтама?`, 
      `Стуктуралистік анықтама`, 
      [
        `Бихевиористік анықтама`,
        `Инструменталистік анықтама`,
        `Телеологиялық анықтама`,
        `Конфликтілік анықтама`
      ],
    ),
    new Test(
      `Діни билік те, азаматтар билігі де бір адамның қолында болатын мемлекеттік басқарудың түрі?`, 
      `Теократия`, 
      [
        `Меритократия`,
        `Технократия`,
        `Геронтократия`,
        `Аристократия`
      ],
    ),
    new Test(
      `Қоғамның саяси жүйесінде болатын өзгерістер?`, 
      `Саяси процесс`, 
      [
        `Саяси сана`,
        `Путч`,
        `Саяси қатынастар`,
        `Саяси мәдениет`
      ],
    ),
    new Test(
      `Ақсүйектер әулеті билік жүргізетін мемлекет түрі?`, 
      `Аристократия`, 
      [
        `Меритократия`,
        `Технократия`,
        `Тирания`,
        `Охлократия`
      ],
    ),
    new Test(
      `Мемлекет тоталитарлық, авторитарлық, демократиялық болып бөлінеді?`, 
      `Билікті жүзеге асыруына қарай бөлінеді`, 
      [
        `Әкімшілік бөлінуіне қарай бөлінеді`,
        `Шекаралық белгісіне қарай бөлінеді`,
        `Экономикалық саясатына қарай бөлінеді`,
        `Әлеуметтік саясатына қарай бөлінеді`
      ],
    ),
    new Test(
      `Азияның қай елдерінде абсолюттік монархия жүйесі орныққан.`, 
      `Кувейт, Оман`, 
      [
        `Иран, Сирия`,
        `Иран, Ливан`,
        `Египет, Судан`,
        `Қазақстан`
      ],
    ),
    new Test(
      `Ерекше қабілетті құзіреттілердің билігі?`, 
      `Меритократия`, 
      [
        `Аристократия`,
        `Теократия`,
        `Плутократия`,
        `Демократия`
      ],
    ),
    new Test(
      `Сыртқы саясатты жүргізуде географиялық факторларды есепке алуға негізделген саяси концепция:`, 
      `Геосаясат`, 
      [
        `Сыртқы саясат`,
        `Ішкі саясат`,
        `Интеграция`,
        `Халықаралық саясат`
      ],
    ),
    new Test(
      `Аталған партиялардың қайсысы ұлттық партиялар қатарына жатады?`, 
      `Алаш партиясы`, 
      [
        `Қазақстан патриоттар партиясы`,
        `Әділет партиясы`,
        `Руханият партиясы`,
        `«Аманат» партиясы`
      ],
    ),
    new Test(
      `Қазақстан Парламентінің сенаттан кейінгі палатасы қалай аталады?`, 
      `Мәжіліс`, 
      [
        `Ассамблея`,
        `Жоғарғы Кеңес`,
        `Сенат`,
        `Ұлттық Жиналыс`
      ],
    ),
    new Test(
      `Қай жылы Қазақстан БҰҰ-ның мүшесі болды?`, 
      `1992 ж.`, 
      [
        `1990 ж.`,
        `1993 ж.`,
        `1995 ж.`,
        `2000 ж.`
      ],
    ),
    new Test(
      `Азаматтардың саяси өмірге қызықпауын саяси мәдениеттің қай тұрпаты көрсетеді?`, 
      `Патриархалды`, 
      [
        `Азаматтық`,
        `Белсенділік`,
        `Қоластылық`,
        `Әлеуметтік`
      ],
    ),
    new Test(
      `Кандидаттың тұлғалық сапаларына, оның адамдарға ұнау қабілетіне бағытталған элитаны іріктеу жүйесі`, 
      `Антрепренерлік жүйе`, 
      [
        `Гильдия жүйесі`,
        `Авторитарлық`,
        `Номенклатуралық`,
        `Өкілеттілік`
      ],
    ),
    new Test(
      `Мемлекетті басқару формасына (биліктің түріне) байланысты қалай бөледі?`, 
      `Монархия, республика`, 
      [
        `Унитарлық, федерация`,
        `Құл иеленуші, феодалдық`,
        `Демократиялық, тоталитарлық`,
        `Бюрократия, элитаризм`
      ],
    ),
    new Test(
      `Қазақстан Республикасының атқарушы билігін кім жүзеге асырады?`, 
      `Үкімет`, 
      [
        `Кеңес`,
        `Сот`,
        `Өкімет`,
        `Прокуратура`
      ],
    ),
    new Test(
      `Элитаның қай іріктеу жүйесі билеушіні тұйық қоғамдық топтан іріктеп алуымен сипатталады?`, 
      `Гильдия`, 
      [
        `Антрепренерлік`,
        `Номенклатуралық`,
        `Өкілеттілік`,
        `Ашық ресми`
      ],
    ),
    new Test(
      `Саясатта, идеологияда, мәдениетте, шаруашылықта басты адамдар түрі?`, 
      `Элита`, 
      [
        `Топ`,
        `Триумфират`,
        `Кеңес`,
        `Сорт`
      ],
    ),
    new Test(
      `Қоғамдағы экономикалық, рухани-адамгершілік, діни, ұлттық қатынастардың жиынтығы?`, 
      `Азаматтық қоғам`, 
      [
        `Саяси система`,
        `Мемлекет`,
        `Ассоцияция`,
        `Құқықтық`
      ],
    ),
    new Test(
      `Партиялық жүйе деген не?`, 
      `Қоғамдағы партиялар жиынтығы`, 
      [
        `Қозғалыс`,
        `Партияларды басқару`,
        `Одаққа бірігуі`,
        `Ұйымдар`
      ],
    ),
    new Test(
      `Саяси партияның басты белгісі?`, 
      `Билікке ұмтылу`, 
      [
        `Мүшелерінің санын көбейту`,
        `Мақсаты жоқ`,
        `Еркіндік`,
        `Тәуелсіздік`
      ],
    ),
    new Test(
      `Саяси мәдениет ұғымын алғаш қолданып, ғылыми әдебиетке енгізуші?`, 
      `И. Гердер`, 
      [
        `М. Вебер`,
        `Ежи Вятр`,
        `Моска`,
        `Аристотель`
      ],
    ),
    new Test(
      `Элита дегеніміз не?`, 
      `Қоғамдағы жоғары мәртебесі мен ықпалы бар ұйымдасқан топ`, 
      [
        `Анасы жағынан туыстар тобы. Әкесі жағынан қандас туыстар тобы`,
        `Құндылықтар, саяси сана, саяи рәміздер, саяси идеология`,
        `Әлеуметтік жағдайына қарай бөлінетін топ`,
        `Табысына қарай жіктелетін топ`
      ],
    ),
    new Test(
      `Мәдениеттанудың теориялық негізі:`, 
      `Мәдениет философиясы`, 
      [
        `Тарихи материализм`,
        `Философия`,
        `Тарих философиясы`,
        `Қоғамтану`
      ],
    ),
    new Test(
      `И.Хейзинга мәдениеттің пайда болуын немен байланыстырады?`, 
      `Ойынмен`, 
      [
        `Сұқбатпен`,
        `Дінмен`,
        `Құмарлықпен`,
        `Еңбекпен`
      ],
    ),
    new Test(
      `Мәдениетті этикамен тығыз байланыстыра қарастырған кім?`, 
      `М.Бахтин`, 
      [
        `А.Швейцер`,
        `Н.Бердяев`,
        `М.Фуко`,
        `Ортега-и-Гассет`
      ],
    ),
    new Test(
      `«Мәдениет және этика» еңбегінің авторы кім?`, 
      `А.Швейцер`, 
      [
        `Л.Толстой`,
        `А.Сахаров`,
        `М.-А.Кинг`,
        `И. Кант`
      ],
    ),
    new Test(
      `Қандай да болмасын негіздемелеріне, белгілеріне қарай мәдениеттер топтандырылуы қалай аталынады:`, 
      `Мәдениет типологиясы.`, 
      [
        `Мәдениет философиясы`,
        `Мәдениет тарихы`,
        `Мәдениет теориясы`,
        `Мәдениет антропологиясы`
      ],
    ),
    new Test(
      `Қандай мәдени құндылықтар ұлттар мәдениеттерінің ерекшіліктерін көрсетеді:`, 
      `Ұлттық`, 
      [
        `Жалпы адамзаттық`,
        `Шектелген топтық`,
        `Отбасылық`,
        `Жеке тұлғалық`
      ],
    ),
    new Test(
      `Ақпараттарды сақтауға жататын символикалық және заттай құралдар:`, 
      `Мәтін, кітап, ескерткіш, сәулет өнері`, 
      [
        `Ауызша сәлемдеме, түсінік, канон`,
        `Уақиғаға байланысты хабар`,
        `Мереке, даталы күндер, торқалы той`,
        `Салт, дәстүр`
      ],
    ),
    new Test(
      `Адамның әлеуметтік-мәдени тұлға ретінде қалыптасуы және даму процесі қалай аталады:`, 
      `Антропосоциогенез`, 
      [
        `Антропоморфизм`,
        `Антропопатизм`,
        `Аккультурация`,
        `Антропоцентризм`
      ],
    ),
    new Test(
      `Түрлі анти-әлеуметтік жастар ағымын белгілейтін термин осылай аталады:`, 
      `Контрмәдениет`, 
      [
        `Элитаралық мәдениет`,
        `Бұқаралық мәдениет`,
        `Концептуалдық мәдениет`,
        `Этномәдениет`
      ],
    ),
    new Test(
      `ХХ ғ жазу мәдениетінен қай мәдениетке ауысу болды?`, 
      `Экрандық`, 
      [
        `Кітап`,
        `Ауызша`,
        `Теледидар`,
        `Бұқаралық`
      ],
    ),
    new Test(
      `Мәдениет құндылықтарын жаппай теріске шығаратын түсінік:`, 
      `Нигилизм`, 
      [
        `Солидаризм`,
        `Ренессанс`,
        `Нивилировка`,
        `Догматизм`
      ],
    ),
    new Test(
      `Өнердің өте ерте кездегі стилдік түрі, ол:`, 
      `синкреттік`, 
      [
        `мифтік`,
        `синтездік`,
        `сенімділік`,
        `таңбалық`
      ],
    ),
    new Test(
      `Бір тілде сөйлейтін, шығу тегі, салты, тұрмысы ортақ адамдар тобы қалай аталады:`, 
      `Этнос`, 
      [
        `Социум`,
        `Қауым`,
        `Класс`,
        `Ұжым`
      ],
    ),
    new Test(
      `Қазіргі заман қоғамында жалпылама қолдануға арналған мәдени құндылықтарды сипаттайтын ұғым:`, 
      `Бұқаралық мәдениет`, 
      [
        `Элитарлық мәдениет`,
        `Материалдық мәдениет`,
        `Постмодерн мәдениеті`,
        `Субкультура`
      ],
    ),
    new Test(
      `Көне архаикалық адамның дүниетанымына барынша тиесілі нәрсе не?`, 
      `Миф`, 
      [
        `Философия`,
        `Дін`,
        `Өнер`,
        `Дәстүр`
      ],
    ),
    new Test(
      `Қазақ ауыз әдебиетіндегі батырлар жыры.`, 
      `Қобыланды`, 
      [
        `Қозы Көрпеш-Баян сұлу`,
        `Қыз Жібек`,
        `Айман-Шолпан`,
        `Күлшеқыз`
      ],
    ),
    new Test(
      `Әсемдік, көркемдік, сұлулық туралы ілім:`, 
      `Эстетика`, 
      [
        `Этика`,
        `Логика`,
        `Аксиология`,
        `Символизм`
      ],
    ),
    new Test(
      `«Мәдениет» термині қай тілден енген?`, 
      `Араб`, 
      [
        `Парсы`,
        `Қытай`,
        `Үнді`,
        `Орыс`
      ],
    ),
    new Test(
      `Қазақ вальсінің королі:`, 
      `Ш.Қалдаяқов`, 
      [
        `М. Төлебаев`,
        `А.Жұбанов`,
        `Л.Хамиди`,
        `К.Дүйсекеев`
      ],
    ),
    new Test(
      `«Мәдениеттану» терминін ғылымға енгізген кім?`, 
      `Л. Уайт`, 
      [
        `О. Шпенглер`,
        `Г. Гегель`,
        `К. Юнг`,
        `И. Кант`
      ],
    ),
    new Test(
      `«Еуропаның күйреуі» еңбегінің авторы.`, 
      `О. Шпенглер`, 
      [
        `Э.Касирер`,
        `К. Поппер`,
        `Ф. Ницше`,
        `Д. Фрезер`
      ],
    ),
    new Test(
      `«Біржан-Сара» операсының авторы:`, 
      `М. Төлебаев`, 
      [
        `А.Жұбанов`,
        `Л.Хамиди`,
        `Е.Брусиловский`,
        `К.Дүйсекеев`
      ],
    ),
    new Test(
      `Өркениет - бұл мәдениеттің локальдық типі деп есептеген кім?`, 
      `Н. Данилевский`, 
      [
        `И.Кант`,
        `Д.Юм`,
        `Ф. Вольтер`,
        `Ш. Фурье`
      ],
    ),
    new Test(
      `Өркениет - мәдениеттің прогресі деп есептеген кім?`, 
      `Д.Белл`, 
      [
        `Л.Морган`,
        `О.Шпенглер`,
        `Н.Данилевский`,
        `И.Гердер`
      ],
    ),
    new Test(
      `Өркениет - мәдениеттің ақыры, оның кәрілік шағы деп кім есептеді?`, 
      `О. Шпенглер`, 
      [
        `Ф. Ницше`,
        `И.Гердер`,
        `Ф. Вольтер`,
        `Д.Белл`
      ],
    ),
    new Test(
      `Өркениет және мәдениет - синонимдер деп есептеген:`, 
      `И.Гердер`, 
      [
        `О.Шпенглер`,
        `Н.Данилевский`,
        `Д.Белл`,
        `Ж.Ж.Руссо`
      ],
    ),
    new Test(
      `Ислам діні өнердің қандай түрімен айналасуға қатаң тиым салады?`, 
      `Адамды құдай бейнесінде бейнелеуге`, 
      [
        `Жалпы адамды бейнелеуге`,
        `Адам мен жан-жануарларды бейнелеуге`,
        `Жан-жануарларды бейнелеуге`,
        `Барлық тірі жанды бейнелеуге`
      ],
    ),
    new Test(
      `Басты құндылық-адам мен оның ақыл-ойы деген қағида қай кезде жүзеге асты?`, 
      `Ағартушылық ғасырында`, 
      [
        `Ортағасырларда`,
        `Қайта жаңғыру дәуірінде`,
        `Реформация дәуірінде`,
        `Антика дәуірінде`
      ],
    ),
    new Test(
      `Ең алғашқы суретшілер кімдер?`, 
      `Алғашқы қауым адамдары`, 
      [
        `Гректер`,
        `Римдіктер`,
        `Арийліктер`,
        `Сақтар`
      ],
    ),
    new Test(
      `Көне түріктердің қандай тотемін сіздер білесіздер?`, 
      `Қасқыр`, 
      [
        `Бұғы`,
        `Жылқы`,
        `Арыстан`,
        `Түйе`
      ],
    ),
    new Test(
      `Ғұндар қандай этномәдени топқа жатады?`, 
      `Прототүріктік`, 
      [
        `Үндіеуропалық`,
        `Протоалтайлық`,
        `Ирандық`,
        `Түріктік`
      ],
    ),
    new Test(
      `Тәңірі бұлардың құдайы:`, 
      `Түркілердің`, 
      [
        `Мысырлықтардың`,
        `Вавилондықтардың`,
        `Шумерліктердің`,
        `Гректердің`
      ],
    ),
    new Test(
      `«Орхон-Енисей» жазбалары осы тілде жазылған:`, 
      `Түркі`, 
      [
        `Қыпшақ`,
        `Қазақ`,
        `Соғды`,
        `Қытай`
      ],
    ),
    new Test(
      `Қазақтардың ата-баба культі осылай аталады:`, 
      `Аруақ`, 
      [
        `Алла`,
        `Домалақ ана`,
        `Ұмай`,
        `Тәңірі`
      ],
    ),
    new Test(
      `«Қайырымды қала» идеясын кім ұсынды?`, 
      `Әл Фараби`, 
      [
        `М.Қашқари`,
        `М.Х.Дулати`,
        `А.Яссауи`,
        `Ж.Баласағұн`
      ],
    ),
    new Test(
      `«Аз и Я» кітабының авторы:`, 
      `О. Сүлейменов`, 
      [
        `О. Шпенглер`,
        `Ж.Ж. Руссо`,
        `К. Ясперс`,
        `Әл-Фараби`
      ],
    ),
    new Test(
      `Кеңес дәуірі кезінде қазақ фольклорын жан-жақты зерттеген әйгілі ғалым:`, 
      `А. Жұбанов`, 
      [
        `Г. Потанин`,
        `А. Затаевич`,
        `Ж. Жабаев`,
        `А. Кастанье`
      ],
    ),
    new Test(
      `«Айман - Шолпан»:`, 
      `Лиро-эпикалық поэма`, 
      [
        `Ұлттық эпос`,
        `Көркемдік роман`,
        `Әңгіме`,
        `Киелі адамдар өмірінің баяндалуы`
      ],
    ),
    new Test(
      `Ежелгі Түркі әдебиетінің ескерткіші:`, 
      `«Қорқыт ата» кітабы`, 
      [
        `«Илиада»`,
        `«Одиссея»`,
        `«Махабхарата»`,
        `«Рамаяна»`
      ],
    ),
    new Test(
      `Әлеуметтік және мәдени құндылықтарды ұрпақтан-ұрпаққа жалғастыру қалай аталады:`, 
      `Сабақтастық`, 
      [
        `Диалектика`,
        `Қозғалыс`,
        `Сана`,
        `Үйлесімділік`
      ],
    ),
    new Test(
      `«Номадизм» ұғымы нені аңғартады?`, 
      `Көшпенділік`, 
      [
        `Отырықшылық`,
        `Жерді өңдеуші`,
        `Діндарлық`,
        `Шамандық`
      ],
    ),
    new Test(
      `Сақтар, скифтер дегеніміз, олар -`, 
      `Ирантілді тайпалар`, 
      [
        `Монғол тайпалары`,
        `Қыпшақ тайпалары`,
        `Түркі тайпалары`,
        `Римдіктер`
      ],
    ),
    new Test(
      `Сопылық бағытты жан-жақты дамытқан ғұлама кім?`, 
      `Қожа Ахмет Яссауи`, 
      [
        `Әл-Фараби`,
        `Ибн-Сина`,
        `Әл-Ғазали`,
        `Ибн-Рушд`
      ],
    ),
    new Test(
      `Ұлттық мәдени үлгіден хабарсыз адам қалай аталады?`, 
      `Мәңгүрт`, 
      [
        `Неофит`,
        `Нигилист`,
        `Маргинал`,
        `Пессимист`
      ],
    ),
    new Test(
      `Ж.Баласағұнның шығармасы?`, 
      `«Құтты білік»`, 
      [
        `«Диуани хикмет»`,
        `«Тарихи рашиди»`,
        `«Қорқыт ата»`,
        `«Диуани лұғат ат түрік»`
      ],
    ),
    new Test(
      `М.Қашқаридың еңбегін атаңыз?`, 
      `«Диуани лұғат ат түрік»`, 
      [
        `«Тарих-и-Рашиди»`,
        `«Куманикус кодексі»`,
        `«Күлтегін»`,
        `«Қорқыт баба кітабы»`
      ],
    ),
    new Test(
      `Ш.Уалиханов жазып алған түркі тілдегі эпос:`, 
      `«Манас»`, 
      [
        `«Қорқыт ата»`,
        `«Қобыланды»`,
        `«Қарақалпақ» дастаны`,
        `«Куманикус» кодексі`
      ],
    ),
    new Test(
      `Тарихи ескерткіш - Есік Қорғаны, қандай мәдени дәуірге тиесілі?`, 
      `Сақ`, 
      [
        `Андрондық`,
        `Ғұн`,
        `Массагет`,
        `Үйсін`
      ],
    ),
    new Test(
      `Қазақстан территориясында сопылықты жан-жақты дамытқан ғұлама кім?`, 
      `Қожа Ахмет Ясауи`, 
      [
        `Әл-Фараби`,
        `Ибн-Сина`,
        `Әл-Газали`,
        `Ибн-Рушд`
      ],
    ),
    new Test(
      `Ортағасырларда Қазақстан территориясында сауда мен қолөнердің дамуына әсер еткен не?`, 
      `Ұлы Жібек жолы`, 
      [
        `Халықтардың ұлы қоныс аударуы`,
        `Ұлы соғыс`,
        `Суару жүйесінің салынуы`,
        `Даланың шексіздігі`
      ],
    ),
    new Test(
      `Ең алғаш рет саясаттанудың дербес пән ретінде оқытыла бастауы?`, 
      `1857 ж. АҚШ, Коллумбия колледжінде`, 
      [
        `1948 ж. ЮНЕСКО басшылығымен, Парижде`,
        `1871 ж. Франция, Саяси ғылымдар мектебінің құрылуы`,
        `1989-1990 жж., Балтық бойы елдерінде`,
        `Ежелгі дәуір – Греция мен Римде`
      ],
    ),
    new Test(
      `Саяси процестің бастапқы сатысы ретінде не белгіленеді?`, 
      `Саяси жүйені конституциялық тұрғыдан айқындау`, 
      [
        `Саяси жүйенің өзін-өзі жаңартуы`,
        `Саяси-басқарушылық шешімдерді қабылдау және орындау`,
        `Саяси жүйенің жағдайы мен іс-әрекетін бақылау`,
        `Саяси жүйенің белгілерін тудыру`
      ],
    ),
    new Test(
      `«Қазақ КСР-інің Мемлекеттік егемендігі туралы Декларация» қай жылы қабылданды?`, 
      `1990 ж.`, 
      [
        `1993 ж.`,
        `1995 ж.`,
        `1989 ж.`,
        `1982 ж.`
      ],
    ),
    new Test(
      `АҚШ-тың негізгі екі партиясын ата?`, 
      `Республикалық және демократиялық`, 
      [
        `Лейбористік және демократиялық`,
        `Комунистік және социалистік`,
        `Либералдық және центристік`,
        `Консервативтік және центристік`
      ],
    ),
    new Test(
      `Парламент, президент немесе жергілікті өкімет сайлауына қатысатын сайлаушылар тобы?`, 
      `Электорат`, 
      [
        `Әлеуметтік топ`,
        `Элита`,
        `Партия`,
        `Қоғамдық ұйым`
      ],
    ),
    new Test(
      `Егеменділік идеясының авторы?`, 
      `Ж. Ж. Руссо`, 
      [
        `И. Кант`,
        `Дж. Локк`,
        `Ш.Л.Монтескье`,
        `Г. Алмонд`
      ],
    ),
    new Test(
      `Ақсақалдардың билік жүргізуі?`, 
      `Геронтократия`, 
      [
        `Плутократия`,
        `Охлократия`,
        `Бюрократия`,
        `Демократия`
      ],
    ),
    new Test(
      `Саяси элита туралы концепцияның авторлары:`, 
      `Г. Моска, В. Парето`, 
      [
        `Д.Истон, Г. Алмонд`,
        `Платон, Аристотель`,
        `Конфуций, У. Ростоу`,
        `Демокрит, Т. Парсонс`
      ],
    ),
    new Test(
      `Жоғарғы лауазымды адамдарды қылмысы үшін жауапкершілікке және ісін сотта қарауға мүмкіндік беретін ерекше тәртіптің түрі?`, 
      `Импичмент`, 
      [
        `Имидж`,
        `Компромис`,
        `Контракт`,
        `Конфликт`
      ],
    ),
    new Test(
      `Лауазымды қызметке кірісу салтанатты рәсімі?`, 
      `Инаугурация`, 
      [
        `Компания`,
        `Дискриминация`,
        `Контракты`,
        `Контракт`
      ],
    ),
    new Test(
      `Өз көзқарасын, саясатын басқа саясатқа, көзқарасқа қарсы қою, қарсы әрекет жүргізу?`, 
      `Оппозиция`, 
      [
        `Аннексия`,
        `Дискриминация`,
        `Обструкция`,
        `Анархия`
      ],
    ),
    new Test(
      `Бейбітшілікті жақтайтын қоғамдық ағым?`, 
      `Пацифизм`, 
      [
        `Фашизм`,
        `Национал-социализм`,
        `Расизм`,
        `Плюрализм`
      ],
    ),
    new Test(
      `Парламентаризмді, демократияны, экономикадағы бостандықты қолдайтын саяси және идеологиялық ағым?`, 
      `Либерализм`, 
      [
        `Фашизм`,
        `Коммунизм`,
        `Консерватизм`,
        `Социализм`
      ],
    ),
    new Test(
      `Саяси білімнің бірінші түрі?`, 
      `Философия – этикалық түрі`, 
      [
        `Діни-этикалық түрі`,
        `Рационалдық`,
        `Эмпирикалық`,
        `Этикалық`
      ],
    ),
    new Test(
      `В И. Ленин саяси жетекшінің қай кейпіне жатады?`, 
      `Ту көтерер жетекші`, 
      [
        `Өрт сөндіруші жетекші`,
        `Саудагер жетекші`,
        `Қызмет етуші жетекші`,
        `Харизматикалық жетекші`
      ],
    ),
    new Test(
      `Қоғамдағы ауқатты топтардың ерекше миссиясы туралы теория:`, 
      `Элита теориясы`, 
      [
        `Лидерлік теориясы`,
        `Билік теориясы`,
        `Экономикалық теориясы`,
        `Саяси теория`
      ],
    ),
    new Test(
      `Қай мемлекет діни мекемелер мен діни сенімнің мемлекеттен бөлектігін білдіреді?`, 
      `Зайырлы мемлекет`, 
      [
        `Исламдық мемлекет`,
        `Теократиялық мемлекет`,
        `Християндық мемлекет`,
        `Буддалық мемлекет`
      ],
    ),
    new Test(
      `Неміс ғалымы М.Вебер бойынша легитимді билік дегеніміз?`, 
      `халықтың үстемдік етіп отырған саяси билікті мойындауы`, 
      [
        `әртүрлі әлеуметтік топтпрдың үйлесімді өмір сүруі`,
        `зорлыққа негізделген билік`,
        `династияның заңды өкілінің мұрагерлігі`,
        `заңның үстемдік етуі`
      ],
    ),
    new Test(
      `Азаматтардың құқықтарын қорғауды жүзеге асыруға арналған билік?`, 
      `Сот билігі`, 
      [
        `Үкімет билігі`,
        `Атқарушы билік`,
        `Заң шығарушы билік`,
        `Парламент`
      ],
    ),
    new Test(
      `Сайлау жүйесінің қызметін реттейтін құқықтық нормалардың жиынтығы?`, 
      `Сайлау құқығы`, 
      [
        `Заң шығару құқығы`,
        `Мемлекет ісін басқаруға қатысу құқығы`,
        `Жиналыстар өткізуге құқығы`,
        `Бірлесу бостандығына құқығы`
      ],
    ),
    new Test(
      `Мемлекеттің пайда болуын құдайдың құдіретімен түсіндіретін теория:`, 
      `Теологиялық теория`, 
      [
        `Марксистік теория`,
        `Географиялық теория`,
        `Психологиялық теория`,
        `Бихевиористік теория`
      ],
    ),
    new Test(
      `Саяси жүйе теориясының авторы?`, 
      `Истон`, 
      [
        `Дюверже`,
        `Вебер`,
        `Михэльс`,
        `Шарон`
      ],
    ),
    new Test(
      `Қоғамды басқарудың әдіс-тәсілдер жиынтығы?`, 
      `Саяси тәртіп`, 
      [
        `Саяси жүйе`,
        `Саяси мәдениет`,
        `Саяси сана`,
        `Саяси партия`
      ],
    ),
    new Test(
      `Саяси мәдениет дегеніміз?`, 
      `Саяси сана мен іс-әрекеттердің ұқсастық жиынтығы`, 
      [
        `Қоғамның саяси жүйесінің негізгі элементі`,
        `Құқықтар мен міндеттер жиынтығы`,
        `Саяси қызметте ұстанатын идеялар мен көзқарастар`,
        `Қоғамды басқарудың әдіс-тәсілдер жиынтығы`
      ],
    ),
    new Test(
      `Басқалардың пікіріне, сеніміне, тәртібіне шыдамдылық көрсету?`, 
      `Толеранттық`, 
      [
        `Либерализм`,
        `Экстремизм`,
        `Шовинизм`,
        `Космополитизм`
      ],
    ),
    new Test(
      `Құқықтық мемлекеттің негізгі белгісі:`, 
      `Заң үстемдік ететін мемлекеттік құрылыс`, 
      [
        `Бір таптың мүддесін қорғайтын мемлекеттік құрылыс`,
        `Жеке адамның үстемдігін қорғайтын мемлекеттік құрылыс`,
        `Саяси партияның үстемдігіне негізделген мемлекеттік құрылыс`,
        `Халық үстемдік ететін мемлекеттік құрылыс`
      ],
    ),
    new Test(
      `Мемлекеттік билікті қолға алуға немесе билік жүргізуге қатынасуға бағытталған, ортақ мүдде, бір идеология негізінде құралған адамдардың ерікті одағы:`, 
      `Саяси партия`, 
      [
        `Кәсіподақ ұйымы`,
        `Шығармашылық одақ`,
        `Діни бірлестік`,
        `Қоғамдық қозғалыс`
      ],
    ),
    new Test(
      `Азаматтық қоғам дегеніміз:`, 
      `Мемлекеттік құрылымнан тыс қалыптасатын қоғамдық қатынастар жиынтығы`, 
      [
        `Алғашқы қауымдық құрылыстағы рулық-тайпалық қатынастар жиынтығы`,
        `Мемлекеттегі саяси институттар мен саяси қатынастар жиынтығы`,
        `Саяси партиялар мен қоғамдық ұйымдар жиынтығы`,
        `Азаматтардың құқықтары мен бостандықтарын қорғайтын қоғамдық тәртіп`
      ],
    ),
    new Test(
      `Қазақстан Халқы Ассамблеясы қашан құрылды?`, 
      `1995`, 
      [
        `1996`,
        `2000`,
        `2001`,
        `2005`
      ],
    ),
    new Test(
      `«Невада - Семей» қозғалысы қашан құрылды, кім ұйымдастырды?`, 
      `О.Сүлейменов, 1989`, 
      [
        `М.Шаханов, 1988`,
        `А.Асылбеков, 1987`,
        `М.Әуезов, 1990`,
        `А.Бөкейханов, 1917`
      ],
    ),
    new Test(
      `Мемлекеттер арасындағы саяси, экономикалық, әскери және басқа да мүдделердің ортақтығы негізінде саяси қатынастардың жақындасуға, бірлесуге ұмтылу процесі:`, 
      `Интеграция`, 
      [
        `Дезинтеграция`,
        `Милитаризация`,
        `Консолидация`,
        `Демократизм`
      ],
    ),
    new Test(
      `Төртінші билік деп нені айтады?`, 
      `Ақпарат құралдарын`, 
      [
        `Сот билігі`,
        `Заң шығарушы билік`,
        `Атқарушы билік`,
        `Легитимділік`
      ],
    ),
    new Test(
      `Белгілі аумақ шеңберінде адамдардың әлеуметтік топтар, таптар мен бірлестіктердің қатынастары мен қызметтерін ұйымдастыратын, бағалайтын қоғамның саяси жүйесінің негізгі элементі?`, 
      `Мемлекет`, 
      [
        `Азаматтық қоғам`,
        `Халық`,
        `Партия`,
        `Шаруа`
      ],
    ),
    new Test(
      `Қоғамның бұқаралық ұйымы?`, 
      `Кәсіподақтар`, 
      [
        `Саяси партиялар`,
        `Діни ұйымдар`,
        `Мемлекет`,
        `Әйелдер одағы`
      ],
    ),
    new Test(
      `Сыртқы саясат - бұл?`, 
      `Халықаралық аренада жеке мемлекетдің дүниежүзілік дәрежеде жүргізген іс-әрекеттері`, 
      [
        `Адамдар арасында жүзеге асатын байланыстар`,
        `Халықтардың өзара әрекет формалары мен қатынастарының жиынтығы`,
        `Ұлтаралық және мемелкетаралық қатынастар саласындағы қоғамдық қатынастардың түрі`,
        `Қоғамның саяси жүйесінің әрекет ету тәсілі`
      ],
    ),
    new Test(
      `Әл-Фарабидің саяси ойлары баяндалған еңбегі:`, 
      `«Қайырымды қала тұрғындарының көзқарастары туралы трактат»`, 
      [
        `Халықтардың өзара әрекет формалары мен қатынастарының жиынтығы`,
        `«Диуани Хикмет»`,
        `«Құтты білік»`,
        `«Тарих-и Рашиди»`
      ],
    ),
    new Test(
      `Белгілі бір идеяны, талапты жақтаушы көпшіліктің салтанатты жүруі, саяси биліктің әрекетін қолдау не оған қарсылық білдіруі қалай аталады?`, 
      `Шеру`, 
      [
        `Ереуіл`,
        `Путч`,
        `Плебисицт`,
        `Референдум`
      ],
    ),
    new Test(
      `«Алаш» партиясының негізін қалаушы:`, 
      `Ә. Бөкейханов`, 
      [
        `М. Шоқай`,
        `Ж.Шаяхметов`,
        `С. Сейфуллин`,
        `Ш. Уәлиханов`
      ],
    ),
    new Test(
      `Жеке адамның саяси және экономикалық құқықтарын мақұлдап, мемлекеттің эконмикаға араласуын шектеуге тырысатын ілім:`, 
      `Либерализм`, 
      [
        `Тоталитаризм`,
        `Коммунизм`,
        `Фашизм`,
        `Макиавелизм`
      ],
    ),
    new Test(
      `Геосаясат тұжырымының негізін қалаған кім?`, 
      `Ф. Ратцель, Х. Маккиндер`, 
      [
        `Монтескье`,
        `Джон Локк`,
        `Ж.Ж.Руссо`,
        `Б. Спиноза`
      ],
    ),
    new Test(
      `Өз халқының, мемлекетінің мақсат-қажеттілігін сезініп білу, оны іске асыруға тырысушылық:`, 
      `Ұлттық мүдде`, 
      [
        `Ұлттық сана`,
        `Ұлттық мәселе`,
        `Ұлттық қауіпсіздік`,
        `Ұлттық саясат`
      ],
    ),
    new Test(
      `Саяси қысым жасау мақсатында жұмысты тоқтату, белгілі бір талаптарды қабылдауға тырысушылық?`, 
      `Ереуіл`, 
      [
        `Шеру`,
        `Плебисицт`,
        `Сайлау`,
        `Референдум`
      ],
    ),
    new Test(
      `Конфедерацияның белгілерінің біреуін көрсетіңіз:`, 
      `Бір конституцияның болмауы`, 
      [
        `Жоғарғы органдардың бірегей жүйесі`,
        `Бірегей құқықтық жүйе`,
        `Бірегей валютаның шектеулі жүруі`,
        `Бірегей мемлекеттік құрылыс`
      ],
    ),
    new Test(
      `Президенттік республиканың парламенттік республикадан қандай айырмашылығы бар?`, 
      `Үкіметті президент тағайындайды және сайлау парламентке тәуелсіз`, 
      [
        `Жеке дыбыс емес, жалпы сөз бен фразаға сәйкес әртүрлі белгілірді қолдану`,
        `Биліктің бөлінуінің болмауы`,
        `Жергілікті өкіметтің қызметінің шектеулігі`,
        `Биліктің шектеулі болуы`
      ],
    ),
    new Test(
      `Мемлекеттер арасындағы жасалған шартты жоғарғы өкімет орындарының бекітуі?`, 
      `Ратификация.`, 
      [
        `Реваншизм`,
        `Декларация`,
        `Преамбула`,
        `Позиция`
      ],
    ),
    new Test(
      `Платон меншіктің қай түрін жақтады?`, 
      `Қоғамдық меншік`, 
      [
        `Мемлекеттік меншік`,
        `Жеке меншік`,
        `Өзіндік меншік`,
        `Жалпы меншік`
      ],
    ),
    new Test(
      `Аристотель меншіктің қай түрін жақтады?`, 
      `Жеке меншік`, 
      [
        `Қоғамдық меншік`,
        `Мемлекеттік меншік`,
        `Өзіндік меншік`,
        `Акционерлік меншік`
      ],
    ),
    new Test(
      `Саяси жүйенің негізгі төрт құрылымын ата?`, 
      `Саяси институттар, саяси қартынастар, саяси ережелер, саяси мәдениет`, 
      [
        `Әдістер, амалдар, тәсілдер, ережелер, принциптер, саяси қозғалыстар`,
        `Ережелер, нормалар, заңдар, тұжырымдар,`,
        `Мемлекет, саяси партия, ұйымдар, бірлестіктер`,
        `Құндылықтар, саяси сана, саяи рәміздер, саяси идеология`
      ],
    ),
    new Test(
      `Қазына-байлықты, қаржы- қаражатты бөлуге байланысты және басқа да саяси маңызды шешімдер қабылдауға қатысты жоғары мәртебесі мен ықпалы бар ұйымдасқан топ:`, 
      `Саяси элита`, 
      [
        `Саяси жетекшілік`,
        `Интеллигенция`,
        `Саяси партия`,
        `Саяси клуб`
      ],
    ),
    new Test(
      `Жалпы адамдардың санасымен, топтың санасымен және әлеуметтік қауымдастықтың қызметімен байланысты қоғамдық сананың бір түрі.`, 
      `Бұқаралық сана`, 
      [
        `Бұқаралық мәдениет`,
        `Идеология`,
        `Дін`,
        `Идея`
      ],
    ),
    new Test(
      `Мәдениеттің функционалдық теориясының авторы кім?`, 
      `Б. Малиновский`, 
      [
        `З.Фрейд`,
        `А.Тойнби`,
        `Н.Данилевский`,
        `К.Маркс`
      ],
    ),
    new Test(
      `Еуропалық дәстүрде мәдениетке қарсы қойылған ұғым:`, 
      `Натура`, 
      [
        `Тағылық`,
        `Варварлық`,
        `Өркениет`,
        `Надандық`
      ],
    ),
    new Test(
      `Экрандық мәдениет қандай әлеуметтік құбылыс негізінде пайда болды?`, 
      `Ғылыми-техникалық, ақпараттық революция және жаңа экономикалық тәртіп`, 
      [
        `Қола дәуірінде Қазақстанды мекендеген тайпалар мәдениеті, тасқа сурет салу`,
        `Әдебиет, өнер және ғылымның өркендеуі`,
        `Бұқаралық ақпарат құралдарының сапалық өзгерістері`,
        `Ғылыми-техникалық прогресс`
      ],
    ),
    new Test(
      `Ежелгі Қосөзеннің әдеби мұрасы?`, 
      `Гильгамеш туралы эпос`, 
      [
        `Манас`,
        `Алпамыс`,
        `Қобыланды`,
        `Ер Тарғын`
      ],
    ),
    new Test(
      `Жазбаша мәдениет тұңғыш қай өркениетте пайда болды?`, 
      `Шумер және Египет`, 
      [
        `Антикалық мәдениет`,
        `Египет`,
        `Үнді мен Қытайда`,
        `Римде`
      ],
    ),
    new Test(
      `Алғашқы өркениеттер К. Ясперстің пікірі бойынша қай жерлерде пайда болды?`, 
      `Ніл, Қозөзен, Инд, Хуанхе аңғарлары`, 
      [
        `Ежелгі Греция, Рим`,
        `Орта және Орталық Азия`,
        `Египет пен Шумерде`,
        `Үнді мен Қытайда`
      ],
    ),
    new Test(
      `Мұсылман миниатюрасының ерекшелігі:`, 
      `Әдеби шығарма желісі баяндалуы`, 
      [
        `Ислам жайлы сауат беруі`,
        `Патшалар өмірінің баяндалуы`,
        `Мұсылман әйелдерінің өмірінің баяндалуы`,
        `Киелі адамдар өмірінің баяндалуы`
      ],
    ),
    new Test(
      `«Бұқаралық» қоғам және «бұқаралық» мәдениет концепциясы авторы кім?`, 
      `Х.Ортега-и-Гассет`, 
      [
        `А.Тоффлер`,
        `В.Дильтей`,
        `Тейер де Шарден`,
        `К.Ясперс`
      ],
    ),
    new Test(
      `Неміс философы мен тарихшысы О.Шпенглердің мәдениет туралы еңбегі қалай аталады:`, 
      `«Еуропаның күйреуі»`, 
      [
        `«Адамзат тарихы философиясы»`,
        `«Мәдениетке риза болмау»`,
        `«Адам Феномені»`,
        `«Мәдениеттің үш келбеті»`
      ],
    ),
    new Test(
      `«Ұлы Даланың жеті қыры» мақаласындағы қазақ жерінің ежелгі кен өндіру орталықтарының бірі болғандығын көрсететін негізгі бағыттарының бірі:`, 
      `Ұлы даладағы ежелгі металлургия`, 
      [
        `Түркі әлемінің бесігі`,
        `Ұлы Жібек жолы`,
        `Аң стилі`,
        `Алтын адам`
      ],
    ),
    new Test(
      `Қазіргі Қазақстан аумағында жылқының алғаш рет қолға үйретілгенін дәлелдейтін энеолит дәуіріне тиесілі тарихи қоныс қалай аталады?`, 
      `Ботай қонысы`, 
      [
        `Беғазы-Дәндібай`,
        `Арқайым`,
        `Қаратау жотасы`,
        `Атасу`
      ],
    ),
    new Test(
      `Номадтардың дүниетанымы:`, 
      `Қозғалыс және соған байланысты ділдің қалыптасуы`, 
      [
        `Бұқаралық ақпарат құралдарының сапалық өзгерістері`,
        `Кеңістіктегі үздіксіз қозғалыс`,
        `Тұрақсыздық`,
        `Мәңгілік`
      ],
    ),
    new Test(
      `Номадалық өркениеттердің өрістеген аймағы?`, 
      `Еуразиялық дала`, 
      [
        `Туран`,
        `Иран`,
        `Ордос`,
        `Алтай`
      ],
    ),
    new Test(
      `Әйгілі халықаралық Ұлы Жібек сауда жолы қай кезеңнен әйгілі?`, 
      `VІІ - Х ғғ.`, 
      [
        `ХVІ ғ.`,
        `ХVІІ ғ.`,
        `ХІХ ғ.`,
        `ХІ - ХІІІ ғғ.`
      ],
    ),
    new Test(
      `Ортағасырлық Тараз мәдениетінің гүлденген кезеңі, ол:`, 
      `Х-ХПғғ.`, 
      [
        `ХIV-ХVIғғ.`,
        `ХПғ.`,
        `IХ-Хғғ.`,
        `ХV-ХVПғғ.`
      ],
    ),
    new Test(
      `Ортағасырлық Таразда ерекше дамыған өнер түрлерін ата.`, 
      `Көзешілік пен зергерлік`, 
      [
        `Сәулет пен зергерлік`,
        `Жерді өңдеу`,
        `Жерді суландыру жүйесі`,
        `Сауда мен жерді өңдеу`
      ],
    ),
    new Test(
      `VI-XII ғғ түрік тайпаларының мәдени дамуына негіз болған дәстүр:`, 
      `Ауыз әдебиеті`, 
      [
        `Жазу-сызу`,
        `Ғылым`,
        `Философия`,
        `Дін`
      ],
    ),
    new Test(
      `«Қозы көрпеш-Баян сұлу», «Қыз Жібек», «Қобыланды батыр», - жанрдың қай түріне жатады?`, 
      `Эпос`, 
      [
        `Болған оқиға`,
        `Дастан`,
        `Философиялық`,
        `Діни`
      ],
    ),
    new Test(
      `Революцияға дейінгі қазақ халқының музыка мәдениетін терең зерттеген ғалым:`, 
      `Затаевич А.`, 
      [
        `Потанин Г.`,
        `Кастанье А.`,
        `Эйхгорн А.`,
        `Рыбаков С.`
      ],
    ),
    new Test(
      `Мәдениеттің қай түрі объективтік заңдар негізінде суреттеу, түсіндіру, шындықты болжау қызметін атқарады:`, 
      `Ғылым`, 
      [
        `Мифология`,
        `Дін`,
        `Техника`,
        `Мораль`
      ],
    ),
    new Test(
      `Қазақ совет мәдениетінің белгілі қайраткерлерін атап өтіңіз:`, 
      `Жамбыл, С.Сейфуллин, М.Әуезов`, 
      [
        `Абай, Жамбыл, Алтынсарин`,
        `Шәкәрім, Міржақып, Д.Нұрпейісова`,
        `Құрманғазы, Дәулеткерей, М.Әуезов`,
        `Ш.Уәлиханов, Абай, Алтынсарин`
      ],
    ),
    new Test(
      `Қазақ мәдениетінің «архетипіне» не жатады?`, 
      `Еуроазиялық дала мәдениеті, тәңірлік дін және түрік өркениеті`, 
      [
        `Көшпенділер мәдениеті, буддалық дін, егіншілік`,
        `Ислам діні, зороастризм, веда`,
        `Зороастризм, иудаизм, табиғатты қастерлеу`,
        `Халық ауыз әдебиеті, ведалык әдебиет, буддизм`
      ],
    ),
    new Test(
      `Этикалық шығармалардың романтикалық бағытына қандай эпос жатады:`, 
      `Қыз Жібек`, 
      [
        `Алпамыс`,
        `Қобыланды`,
        `Едіге`,
        `Ер Тарғын`
      ],
    ),
    new Test(
      `Этникалық жағынан туыс бірнеше мәдениеттердің бірігіп жаңа үлкен мәдениет түзеуі қалай аталады?`, 
      `Мәдени консолидация`, 
      [
        `Субкультура`,
        `Мәдени Ассимиляция`,
        `Аккультурация`,
        `Мәдени Интеграция`
      ],
    ),
    new Test(
      `Е.Брусиловскийдің операсы:`, 
      `«Қыз-Жібек»`, 
      [
        `«Су перісі»`,
        `«Аида»`,
        `«Иван Грозный»`,
        `«Садко»`
      ],
    ),
    new Test(
      `Адам санасын өзгертеді:`, 
      `Интеллект`, 
      [
        `Дін`,
        `Ежелгі сенімдер`,
        `Мифология`,
        `Дәстүр`
      ],
    ),
    new Test(
      `Түркістан жерінде Темірланның тұсында салынған ғимарат:`, 
      `Яссауи мавзолейі`, 
      [
        `Баба ата`,
        `Ақ төбе`,
        `Айша бибі`,
        `Қорқыт ата қорғаны`
      ],
    ),
    new Test(
      `Қазақтың этникалық-мәдени біліміне тән ерекшелік:`, 
      `Ұлттық сананы қалыптастыру`, 
      [
        `Адамның ұлттық-мәдени қажеттілігін айқындау`,
        `Этникалық қауымдастықтың жаңаруын қалыптастыру`,
        `Мәдениеттердің өзара кірігуін жүйелеу`,
        `Рухани экспансияны жүзеге асыру`
      ],
    ),
    new Test(
      `Анахарсис қай мәдениеттің ғұлама қайраткері`, 
      `Скиф-сақ`, 
      [
        `Ғұн`,
        `Қазақ`,
        `Түркі`,
        `Үйсін`
      ],
    ),
    new Test(
      `Қола дәуірінде Қазақстанды мекендеген тайпалар мәдениеті:`, 
      `Андронов`, 
      [
        `Сақтар`,
        `Түркі`,
        `Палеолит`,
        `Мезолит`
      ],
    ),
    new Test(
      `Орыс алфавитін негіз ете отырып қазақ алфавитін өңдеген кім ?`, 
      `А. Байтұрсынұлы`, 
      [
        `Ы. Алтынсарин`,
        `М. Жұмабаев`,
        `С. Сейфуллин`,
        `М. Дулатов`
      ],
    ),
    new Test(
      `Музыканың ұлы кітабының авторы:`, 
      `Әл Фараби`, 
      [
        `Ибн Сина`,
        `Фирдоуси`,
        `Науаи`,
        `Хорезми`
      ],
    ),
    new Test(
      `Бізге жазба деректерден белгілі ғұн патшасы?`, 
      `Аттила`, 
      [
        `Томирис`,
        `Чжи-Чжи`,
        `Тоныкөк`,
        `Білге қаған`
      ],
    ),
    new Test(
      `Қазақ ауыз әдебиетінің көрнекті өкілдерін құрады`, 
      `Жыраулар, жыршылар, шешендер`, 
      [
        `Жазушылар, сатириктер, билер`,
        `Ақсүйектер, зиялылар`,
        `Қожалар, төрелер`,
        `Молдалар, сопылар`
      ],
    ),
    new Test(
      `«Қалқаман-Мамыр» поэмасының авторы:`, 
      `Ш. Кұдайбердиев`, 
      [
        `Абай Құнанбаев`,
        `Ы. Алтынсарин`,
        `Ш. Уалиханов`,
        `С. Көбеев`
      ],
    ),
    new Test(
      `«Көшпенділер» трилогиясының авторы:`, 
      `И. Есенберлин`, 
      [
        `М. Мақатаев`,
        `О. Сулейменов`,
        `А. Қашаубаев`,
        `М. Шаханов`
      ],
    ),
    new Test(
      `«Қазақ әлемі» кітаптың авторы?`, 
      `Ақселеу Сейдімбек`, 
      [
        `Манаш Қозыбаев`,
        `Ғарифолла Есім`,
        `Әлкей Марғұлан`,
        `Құрамыс Ермеков`
      ],
    ),
    new Test(
      `Қазақтың тұңғыш суретшісі кім?`, 
      `Қастеев Ә.`, 
      [
        `Оразбаева А.`,
        `Исмаилова Г.`,
        `Қазақбаева Г.`,
        `Жақыпбаев М.`
      ],
    ),
    new Test(
      `Қазақстан өркениетінің негізін құрайтын ұстанымдар:`, 
      `Этникалық және діни үйлестік`, 
      [
        `Геомәдени кеңістік`,
        `Адам мен табиғат жарастығы`,
        `Өзіндік ерекшелік`,
        `Өзгермелі дүние`
      ],
    ),
    new Test(
      `Түркілердің көк аспанның құдіретіне сенуі қалай аталады?`, 
      `Тәңірге табыну`, 
      [
        `Шамандық`,
        `Манихейлік`,
        `Ұмайға табыну`,
        `Анимизм`
      ],
    ),
    new Test(
      `Алғаш рет Қазақстан территориясында ислам дінін мемлекеттік дін деп жариялаған мемлекет:`, 
      `Қарахан мемлекеті`, 
      [
        `Қыпшақ хандығы`,
        `Түркеш қағандығы`,
        `Түрік қағандығы`,
        `Қазақ хандығы`
      ],
    ),
    new Test(
      `Қазақ аңыздарындағы жерұйықты іздеген кім?`, 
      `Асан-қайғы`, 
      [
        `Қорқыт-ата`,
        `Оғыз хан`,
        `Жиренше`,
        `Аяз би`
      ],
    ),
    new Test(
      `Түрік жазба әдебиетінің көне ескерткіштері:`, 
      `Күлтегін, Тоныкөк жазулары`, 
      [
        `Бехустин жазбалары`,
        `Хаммурапи заңдары`,
        `Жарқабақ тастардағы таңбалар`,
        `Ботамойнақ таңбалары`
      ],
    ),
    new Test(
      `Қазақстанда Кеңес Одағы кезінде пайда болған өнер түрлері :`, 
      `Кино, театр, цирк`, 
      [
        `Музыка, поэзия`,
        `Әдебиет`,
        `Ою, өрнек`,
        `Айтыс, көркем сөз`
      ],
    ),
    new Test(
      `Қазақтың тұңғыш кинорежиссері кім?`, 
      `Айманов Ш.`, 
      [
        `Қожықов С.`,
        `Пұсырманов У.`,
        `Әшімов А.`,
        `Нұғманов Н.`
      ],
    ),
    new Test(
      `Қазақстанда алғашқы театр қай қалада ашылды?`, 
      `Қызылордада`, 
      [
        `Алматыда`,
        `Орынборда`,
        `Семейде`,
        `Оралда`
      ],
    ),
    new Test(
      `Қазақстан Республикасында «Мәдени мұра» бағдарламасы қабылданған жыл:`, 
      `2004ж`, 
      [
        `1995ж`,
        `2001ж`,
        `2006ж`,
        `1998ж`
      ],
    ),
    new Test(
      `Қазақстанда алғашқы театр қай жылы ашылды?`, 
      `1926 ж.`, 
      [
        `1934 ж.`,
        `1924 ж.`,
        `1918 ж.`,
        `1931 ж.`
      ],
    ),
    new Test(
      `Мәдениеттану өзіндік пән ретінде қай ғасырда пайда болды?`, 
      `ХІХ ғасырдың соңғы үшінші ширегінде`, 
      [
        `ХХ ғасырдың басында`,
        `ХVІ ғасырдың аяғында`,
        `ХVІІ ғасырдың аяғында`,
        `ХVІІІ ғасырдың ортасында`
      ],
    ),
    new Test(
      `«Белдеулік уақыт» ілімін кім дамытты?`, 
      `К. Ясперс`, 
      [
        `А. Тойнби`,
        `Д. Вико`,
        `Н. Бердяев`,
        `О. Шпенглер`
      ],
    ),
  ];

export default tests;